app/Controllers/Auth/Auth.php

SELECT *
FROM `user`
WHERE `npm` = '4'
 LIMIT 1
---
    public function login()
    {
        $npm = $this->request->getVar('npm');
        $password = $this->request->getVar('password');
        $captcha = $this->request->getVar('captcha');
        $user = $this->userModel->where('npm', $npm)->first();