app/Controllers/Admin/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `transaksi`
SELECT SUM(`nominal_transaksi`) AS `nominal_transaksi`
FROM `transaksi`
JOIN `status_transaksi` ON `status_transaksi`.`id_status_transaksi` = `transaksi`.`id_status_transaksi`
JOIN `jenis_transaksi` ON `jenis_transaksi`.`id_jenis_transaksi` = `transaksi`.`id_jenis_transaksi`
WHERE `status_transaksi`.`id_status_transaksi` = '3'
AND `transaksi`.`updated_at` >= '2023-07-01'
AND `transaksi`.`updated_at` <= '2023-07-31'
 LIMIT 1
SELECT DATE_FORMAT(updated_at, '%M') as month, SUM(nominal_transaksi) as total_nominal
FROM `transaksi`
JOIN `status_transaksi` ON `status_transaksi`.`id_status_transaksi` = `transaksi`.`id_status_transaksi`
JOIN `jenis_transaksi` ON `jenis_transaksi`.`id_jenis_transaksi` = `transaksi`.`id_jenis_transaksi`
WHERE `status_transaksi`.`id_status_transaksi` = '3'
AND `transaksi`.`updated_at` >= '2023-01-01'
AND `transaksi`.`updated_at` <= '2023-12-31'
GROUP BY `month`
SELECT *
FROM `user`
JOIN `role` ON `role`.`id_role` = `user`.`id_role`
JOIN `kartu` ON `kartu`.`id_kartu` = `user`.`id_kartu`
WHERE `npm` = '1'
 LIMIT 1
SELECT *
FROM `transaksi`
JOIN `jenis_transaksi` ON `jenis_transaksi`.`id_jenis_transaksi` = `transaksi`.`id_jenis_transaksi`
JOIN `status_transaksi` ON `status_transaksi`.`id_status_transaksi` = `transaksi`.`id_status_transaksi`
 LIMIT 9
SELECT *
FROM `transaksi`
JOIN `user` ON `user`.`npm` = `transaksi`.`npm`
JOIN `jenis_transaksi` ON `jenis_transaksi`.`id_jenis_transaksi` = `transaksi`.`id_jenis_transaksi`
JOIN `status_transaksi` ON `status_transaksi`.`id_status_transaksi` = `transaksi`.`id_status_transaksi`
WHERE `transaksi`.`npm` = '1'
SELECT *
FROM `role`
---
    public function index()
{
    $limit = 9; // Jumlah item per halaman
    $offset = $this->request->getVar('page') ? ($this->request->getVar('page') - 1) * $limit : 0;
    $totalRows = $this->transaksiModel->countAllResults();

    // Tambahkan parameter tanggal awal dan tanggal akhir untuk memfilter transaksi selama sebulan
    $startDate = date('Y-m-01'); // Tanggal awal bulan saat ini
    $endDate = date('Y-m-t'); // Tanggal akhir bulan saat ini

    // Hitung total nominal transaksi yang disetujui selama sebulan
    $totalApprovedNominal = $this->transaksiModel
        ->selectSum('nominal_transaksi')
        ->join('status_transaksi', 'status_transaksi.id_status_transaksi = transaksi.id_status_transaksi')
        ->join('jenis_transaksi', 'jenis_transaksi.id_jenis_transaksi = transaksi.id_jenis_transaksi')
        ->where('status_transaksi.id_status_transaksi', '3') // Filter status transaksi yang disetujui
        ->where('transaksi.updated_at >=', $startDate) // Filter transaksi mulai dari tanggal awal
        ->where('transaksi.updated_at <=', $endDate) // Filter transaksi sampai tanggal akhir
        ->first();

        $monthlyData = $this->transaksiModel
        ->select("DATE_FORMAT(updated_at, '%M') as month, SUM(nominal_transaksi) as total_nominal")
        ->join('status_transaksi', 'status_transaksi.id_status_transaksi = transaksi.id_status_transaksi')
        ->join('jenis_transaksi', 'jenis_transaksi.id_jenis_transaksi = transaksi.id_jenis_transaksi')
        ->where('status_transaksi.id_status_transaksi', '3') // Filter status transaksi yang disetujui
        ->where('transaksi.updated_at >=', date('Y-01-01')) // Filter transaksi mulai dari Januari
        ->where('transaksi.updated_at <=', date('Y-12-t')) // Filter transaksi sampai Desember
        ->groupBy('month')
        ->findAll();

    $data = [
        'title' => 'Parking Management System',
        'user' => $this->userModel
            ->join('role', 'role.id_role = user.id_role')
            ->join('kartu', 'kartu.id_kartu = user.id_kartu')
            ->where('npm', session('npm'))
            ->first(),
        'transaksi' => $this->transaksiModel
            ->join('jenis_transaksi', 'jenis_transaksi.id_jenis_transaksi = transaksi.id_jenis_transaksi')
            ->join('status_transaksi', 'status_transaksi.id_status_transaksi = transaksi.id_status_transaksi')
            ->findAll($limit, $offset),
        'riwayat' => $this->transaksiModel
            ->join('user', 'user.npm = transaksi.npm')
            ->join('jenis_transaksi', 'jenis_transaksi.id_jenis_transaksi = transaksi.id_jenis_transaksi')
            ->join('status_transaksi', 'status_transaksi.id_status_transaksi = transaksi.id_status_transaksi')
            ->where('transaksi.npm', session('npm'))
            ->findAll(),
        'role' => $this->roleModel->findAll(),