app/Controllers/Admin/Search.php

SELECT *
FROM `user`
JOIN `role` ON `role`.`id_role` = `user`.`id_role`
WHERE `npm` = '2'
 LIMIT 1
---
    public function index()
    {
        $keyword = $this->request->getVar('keyword');
        $startDate = $this->request->getVar('start_date');
        $endDate = $this->request->getVar('end_date');
        $id_status_transaksi = $this->request->getVar('id_status_transaksi');

        $transaksi = $this->transaksiModel->searchTransaksi($keyword, $startDate, $endDate, $id_status_transaksi);

        if (!empty($transaksi)) {
            $data = [
                'title' => 'Parking Management System',
                'user' => $this->userModel
                    ->join('role', 'role.id_role = user.id_role')
                    ->where('npm', session('npm'))
                    ->first(),