app/Controllers/Admin/Transaksi.php

SELECT *
FROM `user`
WHERE `npm` = '2021320010'
 LIMIT 1
SELECT *
FROM `transaksi`
WHERE `npm` = '2021320010'
SELECT *
FROM `rekening`
---
    public function topup()
    {
        if (!$this->validate([
            'nominal' => [
                'rules' => 'numeric',
                'errors' => [
                    'numeric' => 'Pilih Nominal Saldo!',

                ]
            ],
            'jenis_pembayaran' => [
                'rules' => 'numeric|required',
                'errors' => [
                    'numeric' => 'Pilih Metode Pembayaran!',
                    'required' => 'Pilih Metode Pembayaran!'
                ]
            ],

        ])) {
            session()->setFlashdata('error', $this->validator->listErrors());
            return redirect()->back()->withInput();
        }

        $user = $this->userModel->where('npm', session('npm'))->first();
        $transaksiData = $this->transaksiModel->where('npm', session('npm'))->findAll();
        $rekening = $this->rekeningModel->findAll();

INSERT INTO `transaksi` (`kodebooking_transaksi`, `npm`, `id_jenis_transaksi`, `saldoawal_transaksi`, `nominal_transaksi`, `saldoakhir_transaksi`, `id_jenis_pembayaran`, `id_status_transaksi`, `created_at`, `updated_at`) VALUES ('0CZTF6', '2021320010', '1', '130000', '20000', 150000, '2', '1', '2023-07-14 01:37:30', '2023-07-14 01:37:30')
---
            'id_jenis_pembayaran' => $id_jenis_pembayaran,
            'id_status_transaksi' => $id_status_transaksi
        ];
        $this->transaksiModel->save($transaksi);

SELECT *
FROM `rekening`
---
    public function transaksi_kartuHilang()
{
    // Pengambilan data hasil input dari form
    $user = $this->userModel
        ->join('kartu', 'kartu.id_kartu = user.id_kartu')
        ->where('npm', session('npm'))
        ->first();
    $rekening = $this->rekeningModel->findAll();

INSERT INTO `transaksi` (`kodebooking_transaksi`, `npm`, `id_jenis_transaksi`, `saldoawal_transaksi`, `nominal_transaksi`, `saldoakhir_transaksi`, `id_jenis_pembayaran`, `id_status_transaksi`, `created_at`, `updated_at`) VALUES ('JOAXQV', '2021320004', '1', '100000', '20000', 120000, '1', '1', '2023-07-18 02:00:13', '2023-07-18 02:00:13')
---
    $total_harga = $nominal_transaksi + $harga['nominal'];

    // Simpan data booking ke dalam database
    $this->transaksiModel->save([
        'kodebooking_transaksi' =>  $kodebooking_transaksi,
        'npm' => $user['npm'],
        'id_jenis_transaksi' => $idjenis,
        'saldoawal_transaksi' => $saldoawal_transaksi,
        'nominal_transaksi' => $nominal_transaksi,
        'saldoakhir_transaksi' => $saldoakhir_transaksi,
        'id_jenis_pembayaran' => $id_jenis_pembayaran,
        'id_status_transaksi' => $status
    ]);

SELECT *
FROM `rekening`
SELECT *
FROM `user`
JOIN `role` ON `role`.`id_role` = `user`.`id_role`
WHERE `npm` = '2021320010'
 LIMIT 1
SELECT *
FROM `transaksi`
JOIN `user` ON `user`.`npm` = `transaksi`.`npm`
JOIN `jenis_transaksi` ON `jenis_transaksi`.`id_jenis_transaksi` = `transaksi`.`id_jenis_transaksi`
JOIN `status_transaksi` ON `status_transaksi`.`id_status_transaksi` = `transaksi`.`id_status_transaksi`
JOIN `jenis_pembayaran` ON `jenis_pembayaran`.`id_jenis_pembayaran` = `transaksi`.`id_jenis_pembayaran`
WHERE `kodebooking_transaksi` = 'SAWFZP'
 LIMIT 1
---
public function transaksi_result($booking_code, $nominal_saldo, $id_jenis_pembayaran)
{
    $rekening = $this->rekeningModel->findAll();

    $data = [
        'title' => 'Parking Management System',
        'user' => $this->userModel
            ->join('role', 'role.id_role = user.id_role')
            ->where('npm', session('npm'))
            ->first(),
        'transaksi' => $this->transaksiModel
            ->join('user', 'user.npm = transaksi.npm')
            ->join('jenis_transaksi', 'jenis_transaksi.id_jenis_transaksi = transaksi.id_jenis_transaksi')
            ->join('status_transaksi', 'status_transaksi.id_status_transaksi = transaksi.id_status_transaksi')
            ->join('jenis_pembayaran', 'jenis_pembayaran.id_jenis_pembayaran = transaksi.id_jenis_pembayaran')
            ->where('kodebooking_transaksi', $booking_code)
            ->first(), // Menggunakan first() untuk mendapatkan satu data transaksi saja

SELECT *
FROM `user`
JOIN `role` ON `role`.`id_role` = `user`.`id_role`
WHERE `npm` = '1'
 LIMIT 1
SELECT *
FROM `transaksi`
JOIN `user` ON `user`.`npm` = `transaksi`.`npm`
JOIN `jenis_transaksi` ON `jenis_transaksi`.`id_jenis_transaksi` = `transaksi`.`id_jenis_transaksi`
JOIN `status_transaksi` ON `status_transaksi`.`id_status_transaksi` = `transaksi`.`id_status_transaksi`
JOIN `jenis_pembayaran` ON `jenis_pembayaran`.`id_jenis_pembayaran` = `transaksi`.`id_jenis_pembayaran`
ORDER BY `transaksi`.`updated_at` DESC
 LIMIT 9, 9
SELECT COUNT(*) AS `numrows`
FROM `transaksi`
JOIN `user` ON `user`.`npm` = `transaksi`.`npm`
JOIN `jenis_transaksi` ON `jenis_transaksi`.`id_jenis_transaksi` = `transaksi`.`id_jenis_transaksi`
JOIN `status_transaksi` ON `status_transaksi`.`id_status_transaksi` = `transaksi`.`id_status_transaksi`
JOIN `jenis_pembayaran` ON `jenis_pembayaran`.`id_jenis_pembayaran` = `transaksi`.`id_jenis_pembayaran`
---
    public function riwayat()
    {
        $limit = 9; // Jumlah item per halaman
        $currentPage = $this->request->getVar('page_pagination') ? $this->request->getVar('page_pagination') : 1;

        $data =
            [
                'title' => 'Parking Management System',
                'user' => $this->userModel
                    ->join('role', 'role.id_role = user.id_role')
                    ->where('npm', session('npm'))
                    ->first(),
                'transaksi' => $this->transaksiModel
                    ->join('user', 'user.npm = transaksi.npm')
                    ->join('jenis_transaksi', 'jenis_transaksi.id_jenis_transaksi = transaksi.id_jenis_transaksi')
                    ->join('status_transaksi', 'status_transaksi.id_status_transaksi = transaksi.id_status_transaksi')
                    ->join('jenis_pembayaran', 'jenis_pembayaran.id_jenis_pembayaran = transaksi.id_jenis_pembayaran')
                    ->orderBy('transaksi.updated_at', 'DESC')
                    ->paginate($limit, 'pagination'),

SELECT *
FROM `transaksi`
JOIN `jenis_transaksi` ON `jenis_transaksi`.`id_jenis_transaksi` = `transaksi`.`id_jenis_transaksi`
JOIN `status_transaksi` ON `status_transaksi`.`id_status_transaksi` = `transaksi`.`id_status_transaksi`
WHERE `id_transaksi` = '227'
 LIMIT 1
UPDATE `transaksi` SET `bukti_pembayaran` = '20230714095024_1689303024_fbd96f74e169fec80a25.jpg', `updated_at` = '2023-07-14 09:50:24'
WHERE `transaksi`.`id_transaksi` IN ('227')
---
    public function bukti($id_transaksi)
    {
        $data = $this->request->getFile('bukti_pembayaran');
        $id_transaksi_decoded = base64_decode($id_transaksi);
        // Validasi ukuran file
        if ($data->getSize() > 4 * 1024 * 1024) {
            session()->setFlashdata('error', 'Ukuran file melebihi batas maksimum (4MB).');
            return redirect()->back()->withInput();
        }

        $fileName = date('YmdHis') . '_' . $data->getRandomName();
        $uploadDir = 'uploads/bukti/';

        $data->move($uploadDir, $fileName);

        $user = $this->transaksiModel
            ->join('jenis_transaksi', 'jenis_transaksi.id_jenis_transaksi = transaksi.id_jenis_transaksi')
            ->join('status_transaksi', 'status_transaksi.id_status_transaksi = transaksi.id_status_transaksi')
            ->where('id_transaksi', $id_transaksi_decoded)
            ->first();

        $this->transaksiModel->update($user['id_transaksi'], ['bukti_pembayaran' => $fileName]);

SELECT *
FROM `transaksi`
JOIN `user` ON `user`.`npm` = `transaksi`.`npm`
JOIN `kartu` ON `kartu`.`id_kartu` = `user`.`id_kartu`
JOIN `status_transaksi` ON `status_transaksi`.`id_status_transaksi` = `transaksi`.`id_status_transaksi`
JOIN `jenis_transaksi` ON `jenis_transaksi`.`id_jenis_transaksi` = `transaksi`.`id_jenis_transaksi`
WHERE `id_transaksi` = '3'
 LIMIT 1
SELECT *
FROM `user`
JOIN `role` ON `role`.`id_role` = `user`.`id_role`
WHERE `npm` = '2'
 LIMIT 1
---
    public function cetak($id_transaksi)
    {
        $transaksi = $this->transaksiModel
            ->join('user', 'user.npm = transaksi.npm')
            ->join('kartu', 'kartu.id_kartu = user.id_kartu')
            ->join('status_transaksi', 'status_transaksi.id_status_transaksi = transaksi.id_status_transaksi')
            ->join('jenis_transaksi', 'jenis_transaksi.id_jenis_transaksi = transaksi.id_jenis_transaksi')
            ->where('id_transaksi', $id_transaksi)
            ->first();

        $data = [
            'title' => 'Parking Management System',
            'user' => $this->userModel
                ->join('role', 'role.id_role = user.id_role')
                ->where('npm', session('npm'))
                ->first(),