app/Controllers/Admin/Transaksi.php

            'id_status_transaksi' => $id_status_transaksi

        ];
        $this->transaksiModel->save($transaksi);
---
INSERT INTO `transaksi` (`kodebooking_transaksi`, `npm`, `id_jenis_transaksi`, `saldoawal_transaksi`, `nominal_transaksi`, `saldoakhir_transaksi`, `id_jenis_pembayaran`, `id_status_transaksi`, `created_at`, `updated_at`) VALUES ('1KNIPA', '4', '1', '180000', '20000', 200000, '5', '1', '2023-08-03 09:48:38', '2023-08-03 09:48:38')