app/Controllers/Admin/Transaksi.php

SELECT *
FROM `rekening`
---
    public function rekening()
    {
        $data = [
            'title' => 'Parking Management System',
            'user' => $this->userModel
                ->join('role', 'role.id_role = user.id_role')
                ->where('npm', session('npm'))
                ->first(),
            'rekening' => $this->rekeningModel->findAll()