app/Controllers/Keuangan/Transaksi.php

    public function transaksi_inputkodebooking()
    {
        $data =
            [
                'title' => 'Parking Management System',
                'user' => $this->userModel
                    ->join('role', 'role.id_role = user.id_role')
                    ->where('npm', session('npm'))
                    ->first()
---
SELECT *
FROM `user`
JOIN `role` ON `role`.`id_role` = `user`.`id_role`
WHERE `npm` = '2'
 LIMIT 1

    public function transaksi_approve()
{
    $validationRules = [
        'nomor_kartu' => [
            'rules' => 'is_unique[kartu.nomor_kartu]',
            'errors' => [
                'is_unique' => 'Nomor Kartu ini Telah Digunakan Sebelumnya',
                'required' => 'Harus Di Isi'
            ]
        ]
    ];

    if (!$this->validate($validationRules)) {
        session()->setFlashdata('error', $this->validator->listErrors());
        return redirect()->to("keuangan/transaksi_inputkodebooking");
    }

    $kodebooking_transaksi = $this->request->getVar('kode_booking');
    $nomor_kartu = $this->request->getVar('nomor_kartu');

    $approvedBy = $this->userModel
        ->where('npm', session('npm'))
        ->first();
---
SELECT *
FROM `user`
WHERE `npm` = '2'
 LIMIT 1

        $logModel->insert($logData);
        $data = [
            'title' => 'Parking Management System',
            'user' => $this->userModel
                ->join('role', 'role.id_role = user.id_role')
                ->where('npm', session('npm'))
                ->first(['user.*', 'role.nama_role']), // Add 'role.nama_role' to retrieve the role name
            'transaksi' => $this->transaksiModel
                ->join('user', 'user.npm = transaksi.npm')
                ->join('kartu', 'kartu.id_kartu = user.id_kartu')
                ->join('status_transaksi', 'status_transaksi.id_status_transaksi = transaksi.id_status_transaksi')
                ->join('jenis_transaksi', 'jenis_transaksi.id_jenis_transaksi = transaksi.id_jenis_transaksi')
                ->where('kodebooking_transaksi', $kodebooking_transaksi)
                ->first(),
---
SELECT *
FROM `user`
JOIN `role` ON `role`.`id_role` = `user`.`id_role`
WHERE `npm` = '2'
 LIMIT 1
SELECT *
FROM `user`
JOIN `transaksi` ON `transaksi`.`npm` = `user`.`npm`
JOIN `kartu` ON `kartu`.`id_kartu` = `user`.`id_kartu`
WHERE `kodebooking_transaksi` = 'JOAXQV'
 LIMIT 1
SELECT *
FROM `transaksi`
JOIN `user` ON `user`.`npm` = `transaksi`.`npm`
JOIN `kartu` ON `kartu`.`id_kartu` = `user`.`id_kartu`
JOIN `status_transaksi` ON `status_transaksi`.`id_status_transaksi` = `transaksi`.`id_status_transaksi`
JOIN `jenis_transaksi` ON `jenis_transaksi`.`id_jenis_transaksi` = `transaksi`.`id_jenis_transaksi`
WHERE `kodebooking_transaksi` = 'HR3M7B'
 LIMIT 1

        ];


    $transaksi = $this->transaksiModel
        ->join('user', 'user.npm = transaksi.npm')
        ->join('kartu', 'kartu.id_kartu = user.id_kartu')
        ->where('kodebooking_transaksi', $kodebooking_transaksi)
        ->first();

    $this->transaksiModel->save([
        'id_transaksi' => $transaksi['id_transaksi'],
        'saldoawal_transaksi' => $transaksi['saldo'],
        'saldoakhir_transaksi' => $transaksi['saldo'] + $transaksi['nominal_transaksi'],
        'id_status_transaksi' => 3,
        'validator' => $approvedBy['nama'] // Menyimpan data Approved by ke dalam kolom 'approved_by'
    ]);

    if (!$nomor_kartu) {
        $this->kartuModel->save([
            'id_kartu' => $transaksi['id_kartu'],
            'saldo' => $transaksi['saldo'] + $transaksi['nominal_transaksi'],
        ]);
---
SELECT *
FROM `transaksi`
JOIN `user` ON `user`.`npm` = `transaksi`.`npm`
JOIN `kartu` ON `kartu`.`id_kartu` = `user`.`id_kartu`
WHERE `kodebooking_transaksi` = 'HR3M7B'
 LIMIT 1
UPDATE `transaksi` SET `id_transaksi` = '10', `saldoawal_transaksi` = '20000', `saldoakhir_transaksi` = 40000, `id_status_transaksi` = 3, `validator` = 'arief fadhil', `updated_at` = '2023-07-09 22:59:12'
WHERE `transaksi`.`id_transaksi` IN ('10')
UPDATE `kartu` SET `id_kartu` = '93', `saldo` = 40000, `updated_at` = '2023-07-09 22:59:12'
WHERE `kartu`.`id_kartu` IN ('93')

    public function riwayat()
{
    $limit = 9; // Jumlah item per halaman
    $currentPage = $this->request->getVar('page_pagination') ? $this->request->getVar('page_pagination') : 1;

    $data = [
        'title' => 'Parking Management System',
        'user' => $this->userModel
            ->join('role', 'role.id_role = user.id_role')
            ->where('npm', session('npm'))
            ->first(),
        'transaksi' => $this->transaksiModel
            ->join('user', 'user.npm = transaksi.npm')
            ->join('jenis_transaksi', 'jenis_transaksi.id_jenis_transaksi = transaksi.id_jenis_transaksi')
            ->join('status_transaksi', 'status_transaksi.id_status_transaksi = transaksi.id_status_transaksi')
            ->join('jenis_pembayaran', 'jenis_pembayaran.id_jenis_pembayaran = transaksi.id_jenis_pembayaran')
            ->whereIn('transaksi.id_jenis_transaksi', [1, 2]) // Menggunakan whereIn untuk mencari id_jenis_transaksi 1 atau 2
            ->orderBy('transaksi.updated_at', 'DESC') // Menentukan kolom updated_at secara spesifik
            ->paginate($limit, 'transaksi_pagination'),
        'pager' => $this->transaksiModel
            ->join('user', 'user.npm = transaksi.npm')
            ->join('jenis_transaksi', 'jenis_transaksi.id_jenis_transaksi = transaksi.id_jenis_transaksi')
            ->join('status_transaksi', 'status_transaksi.id_status_transaksi = transaksi.id_status_transaksi')
            ->join('jenis_pembayaran', 'jenis_pembayaran.id_jenis_pembayaran = transaksi.id_jenis_pembayaran')
            ->whereIn('transaksi.id_jenis_transaksi', [1, 2]) // Menggunakan whereIn untuk mencari id_jenis_transaksi 1 atau 2
            ->orderBy('transaksi.created_at', 'DESC') // Menentukan kolom created_at secara spesifik
            ->pager,
---
SELECT *
FROM `user`
JOIN `role` ON `role`.`id_role` = `user`.`id_role`
WHERE `npm` = '2'
 LIMIT 1
SELECT *
FROM `transaksi`
JOIN `user` ON `user`.`npm` = `transaksi`.`npm`
JOIN `jenis_transaksi` ON `jenis_transaksi`.`id_jenis_transaksi` = `transaksi`.`id_jenis_transaksi`
JOIN `status_transaksi` ON `status_transaksi`.`id_status_transaksi` = `transaksi`.`id_status_transaksi`
JOIN `jenis_pembayaran` ON `jenis_pembayaran`.`id_jenis_pembayaran` = `transaksi`.`id_jenis_pembayaran`
WHERE `transaksi`.`id_jenis_transaksi` IN (1,2)
ORDER BY `transaksi`.`updated_at` DESC
 LIMIT 9, 9
SELECT COUNT(*) AS `numrows`
FROM `transaksi`
JOIN `user` ON `user`.`npm` = `transaksi`.`npm`
JOIN `jenis_transaksi` ON `jenis_transaksi`.`id_jenis_transaksi` = `transaksi`.`id_jenis_transaksi`
JOIN `status_transaksi` ON `status_transaksi`.`id_status_transaksi` = `transaksi`.`id_status_transaksi`
JOIN `jenis_pembayaran` ON `jenis_pembayaran`.`id_jenis_pembayaran` = `transaksi`.`id_jenis_pembayaran`
WHERE `transaksi`.`id_jenis_transaksi` IN (1,2)
SELECT COUNT(*) AS `numrows`
FROM `transaksi`
JOIN `user` ON `user`.`npm` = `transaksi`.`npm`
JOIN `jenis_transaksi` ON `jenis_transaksi`.`id_jenis_transaksi` = `transaksi`.`id_jenis_transaksi`
JOIN `status_transaksi` ON `status_transaksi`.`id_status_transaksi` = `transaksi`.`id_status_transaksi`
JOIN `jenis_pembayaran` ON `jenis_pembayaran`.`id_jenis_pembayaran` = `transaksi`.`id_jenis_pembayaran`
WHERE `transaksi`.`id_status_transaksi` != 2
SELECT `transaksi`.*, `user`.`nama`, `jenis_transaksi`.`nama_jenis_transaksi`, `status_transaksi`.`nama_status_transaksi`, `jenis_pembayaran`.`nama_jenis_pembayaran`
FROM `transaksi`
JOIN `user` ON `user`.`npm` = `transaksi`.`npm`
JOIN `jenis_transaksi` ON `jenis_transaksi`.`id_jenis_transaksi` = `transaksi`.`id_jenis_transaksi`
JOIN `status_transaksi` ON `status_transaksi`.`id_status_transaksi` = `transaksi`.`id_status_transaksi`
JOIN `jenis_pembayaran` ON `jenis_pembayaran`.`id_jenis_pembayaran` = `transaksi`.`id_jenis_pembayaran`
WHERE `transaksi`.`id_status_transaksi` != 2
ORDER BY `transaksi`.`created_at` DESC
 LIMIT 9