app/Controllers/Keuangan/Transaksi.php

        ->where('kodebooking_transaksi', $kodebooking_transaksi)
        ->first();

    $this->transaksiModel->save([
        'id_transaksi' => $transaksi['id_transaksi'],
        'saldoawal_transaksi' => $transaksi['saldo'],
        'saldoakhir_transaksi' => $transaksi['saldo'] + $transaksi['nominal_transaksi'],
        'id_status_transaksi' => 3,
        'validator' => $approvedBy['nama']
    ]);
---
UPDATE `transaksi` SET `id_transaksi` = '218', `saldoawal_transaksi` = '120000', `saldoakhir_transaksi` = 140000, `id_status_transaksi` = 3, `validator` = 'arief fadhil', `updated_at` = '2023-07-18 02:01:01'
WHERE `transaksi`.`id_transaksi` IN ('218')

    if ($email->send()) {
        $data = [
            'title' => 'Parking Management System',
            'user' => $this->userModel
                ->join('role', 'role.id_role = user.id_role')
                ->where('npm', session('npm'))
                ->first(['user.*', 'role.nama_role']),
            'transaksi' => $this->transaksiModel
                ->join('user', 'user.npm = transaksi.npm')
                ->join('kartu', 'kartu.id_kartu = user.id_kartu')
                ->join('status_transaksi', 'status_transaksi.id_status_transaksi = transaksi.id_status_transaksi')
                ->join('jenis_transaksi', 'jenis_transaksi.id_jenis_transaksi = transaksi.id_jenis_transaksi')
                ->where('kodebooking_transaksi', $kodebooking_transaksi)
                ->first(),
---
SELECT *
FROM `user`
JOIN `role` ON `role`.`id_role` = `user`.`id_role`
WHERE `npm` = '2'
 LIMIT 1
SELECT *
FROM `transaksi`
JOIN `user` ON `user`.`npm` = `transaksi`.`npm`
JOIN `kartu` ON `kartu`.`id_kartu` = `user`.`id_kartu`
JOIN `status_transaksi` ON `status_transaksi`.`id_status_transaksi` = `transaksi`.`id_status_transaksi`
JOIN `jenis_transaksi` ON `jenis_transaksi`.`id_jenis_transaksi` = `transaksi`.`id_jenis_transaksi`
WHERE `kodebooking_transaksi` = 'JOAXQV'
 LIMIT 1