app/Controllers/Keuangan/User.php

    public function create()
    {
        $data = [
            'title' => 'Parking Management System',
            'user' => $this->userModel
                ->join('role', 'role.id_role = user.id_role')
                ->where('npm', session('npm'))
                ->first()
---
SELECT *
FROM `user`
JOIN `role` ON `role`.`id_role` = `user`.`id_role`
WHERE `npm` = '2'
 LIMIT 1