app/Controllers/User/Topup.php

    public function index()
    {
        $data =
            [
                'title' => 'Parking Management System',
                'user' => $this->userModel
                    ->join('kartu', 'kartu.id_kartu = user.id_kartu')
                    ->join('role', 'role.id_role = user.id_role')
                    ->where('npm', session('npm'))
                    ->first()
---
SELECT *
FROM `user`
JOIN `kartu` ON `kartu`.`id_kartu` = `user`.`id_kartu`
JOIN `role` ON `role`.`id_role` = `user`.`id_role`
WHERE `npm` = '4'
 LIMIT 1