app/Controllers/Operator/CheckOut.php

    public function index()
    {
        $nominal_transaksi = $this->request->getVar('nominal_transaksi');
        $user_parking = $this->userModel
            ->join('kartu', 'kartu.id_kartu = user.id_kartu')
            ->where('kartu.nomor_kartu', $this->request->getVar('nomor_kartu'))
            ->first();
        $approvedBy = $this->userModel
            ->where('npm', session('npm'))
            ->first();
---
SELECT *
FROM `user`
JOIN `kartu` ON `kartu`.`id_kartu` = `user`.`id_kartu`
WHERE `kartu`.`nomor_kartu` = '2021320010'
 LIMIT 1
SELECT *
FROM `user`
WHERE `npm` = '3'
 LIMIT 1

                $nama = $user_parking['nama']; // Ganti 'nama' dengan kolom yang menyimpan nama pada tabel pengguna parkir
                $sisa_saldo = $user_parking['saldo'] - $nominal_transaksi;

                $this->transaksiModel->save([
                    'kodebooking_transaksi' => substr(str_shuffle(str_repeat("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ", 6)), 0, 6),
                    'npm' => $user_parking['npm'],
                    'id_jenis_transaksi' => $this->request->getVar('id_jenis_transaksi'),
                    'saldoawal_transaksi' => $user_parking['saldo'],
                    'nominal_transaksi' => $nominal_transaksi,
                    'saldoakhir_transaksi' => $user_parking['saldo'] - $nominal_transaksi,
                    'id_status_transaksi' => $this->request->getVar('id_status_transaksi'),
                    'id_jenis_pembayaran' => $this->request->getVar('id_jenis_pembayaran'),
                    'validator' => $approvedBy['nama']
                ]);

                $this->kartuModel->save([
                    'id_kartu' => $user_parking['id_kartu'],
                    'saldo' => $user_parking['saldo'] - $nominal_transaksi
                ]);
---
INSERT INTO `transaksi` (`kodebooking_transaksi`, `npm`, `id_jenis_transaksi`, `saldoawal_transaksi`, `nominal_transaksi`, `saldoakhir_transaksi`, `id_status_transaksi`, `id_jenis_pembayaran`, `validator`, `created_at`, `updated_at`) VALUES ('1YJCOS', '2021320010', '3', '86000', '3000', 83000, '2', '1', 'dapidah', '2023-07-14 11:00:57', '2023-07-14 11:00:57')
UPDATE `kartu` SET `id_kartu` = '84', `saldo` = 83000, `updated_at` = '2023-07-14 11:00:57'
WHERE `kartu`.`id_kartu` IN ('84')