app/Controllers/Operator/Dashboard.php

SELECT *
FROM `user`
JOIN `role` ON `role`.`id_role` = `user`.`id_role`
WHERE `npm` = '3'
 LIMIT 1
SELECT *
FROM `harga`
WHERE `nama_harga` = 'parkir_motor'
 LIMIT 1
SELECT *
FROM `harga`
WHERE `nama_harga` = 'parkir_mobil'
 LIMIT 1
SELECT *
FROM `transaksi`
WHERE `id_jenis_transaksi` = 3
---
    public function index()
    {
        //tolong masukin di setiap method//
        $data =
            [
                'title' => 'Parking Management System',
                'user' => $this->userModel
                    ->join('role', 'role.id_role = user.id_role')
                    ->where('npm', session('npm'))
                    ->first(),
                'parkir_motor' => $this->hargaModel->where('nama_harga', 'parkir_motor')->first(),
                'parkir_mobil' => $this->hargaModel->where('nama_harga', 'parkir_mobil')->first(),
                'riwayat' => $this->transaksiModel->where('id_jenis_transaksi', 3)->findAll()