app/Models/TransaksiModel.php

    public function searchTransaksi($keyword, $startDate, $endDate, $id_status_transaksi)
    {
        $query = $this->select('transaksi.*, user.nama')
            ->join('user', 'user.npm = transaksi.npm')
            ->join('status_transaksi', 'status_transaksi.id_status_transaksi = transaksi.id_status_transaksi')
            ->join('jenis_transaksi', 'jenis_transaksi.id_jenis_transaksi = transaksi.id_jenis_transaksi');

        if (!empty($keyword)) {
            $query->groupStart()
                ->like('transaksi.kodebooking_transaksi', $keyword)
                ->orLike('user.npm', $keyword)
                ->orLike('user.nama', $keyword)
                ->groupEnd();
        }

        if (!empty($startDate) && !empty($endDate)) {
            $query->where('transaksi.created_at >=', $startDate . ' 00:00:00')
                ->where('transaksi.created_at <=', $endDate . ' 23:59:59');
        }

        if (!empty($id_status_transaksi)) {
            $query->where('transaksi.id_status_transaksi', $id_status_transaksi);
        }

        return $query->get()->getResultArray();
---
SELECT `transaksi`.*, `user`.`nama`
FROM `transaksi`
JOIN `user` ON `user`.`npm` = `transaksi`.`npm`
JOIN `status_transaksi` ON `status_transaksi`.`id_status_transaksi` = `transaksi`.`id_status_transaksi`
JOIN `jenis_transaksi` ON `jenis_transaksi`.`id_jenis_transaksi` = `transaksi`.`id_jenis_transaksi`